import pandas as pd

print('----'*30)
print('Табель учащихся в средней школе 8 ')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Иван','Александр','Екатерина'],
        'Фамилия': ['Сидоров','Тванов','Лебедева'],
        'Дата рождения' : ['18.08.2002','05.06.2003','08.08.1998'],
        'Успеваемость' : ['Отличник','Троечник','Хорошист']
}
    
sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')
    
print(sc)