"""
Написать программу «Телефонный справочник». Данные справочника должны быть представлены в виде таблицы.
Предлагаемые имена столбцов таблицы:  id, имя, фамилия, день рождения, место работы, номер телефона (может быть несколько).
Программа должна быть модульной (примерную структуру модулей смотрите ниже).
Программа должна уметь создавать справочник и сохранять его в файл, загружать из файла.
Необходимо организовать просмотр информации из справочника, редактирование и удаление записей.
В качестве формата файла можно использовать форматы csv и json.
Список названий возможных модулей:
main – точка входа.
view – модуль отображения.
model – модуль работы с данными.
logger – модуль логгирования.
controller – связь между модулями.
"""
