#"""
#Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек
#в этой четверти (x и y).

#Ввод: значение типа <int>
#Вывод: значение типа <str>

#Пример:

#3
#x < 0, y < 0
#"""
int = int(input('Введите номер четверти в которой бы хотели узнать диапозон возможных координат: '))

1 ==  a , если:
    print('В первой четверти - x > 0 y > 0')
2 == a  элиф:
    print('Во второй четверти - x < 0 y > 0')
3 == a  элиф:
    print('В третьей четверти - x < 0 y < 0')
4 == a  элиф:
    print('В четвертой четверти - x > 0 y < 0')
ещё:
    print('Такой четверти нет :(')
