"""
Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

Ввод: значение типа <float>
Вывод: значение типа <int>

Примеры:
6782.0 -> 23
0.56 -> 11          """

# number = input('Введите вещественное число ')
# sum = 0
# for i in number:
#     if i.isdigit(): 
#         sum = sum + int(i)
# print(f"Сумма цифр в числе {number} равна {sum}")


# # 2 var
# number = ""
# while (not number.isdecimal()):
#     number = (input('Введите вещественное число:'))
# sum = 0
# for i in number:
#     if i.isdigit():
#         sum = sum + int(i)
# print(f"сумма цифр:{sum}")
