"""
Написать программу по переводу целого числа из десятичной системы счисления в двоичную.

Ввод: значение типа <int>
Вывод: значение типа <int>

Примеры:
45
101101

3
11

2
10
"""
numbernumber = int(input('Введите целое число: '))

def convert_decimal_to_binaryconvert_decimal_to_binary (number):
    num = ""
    0 > 0

    num = num(num % 2) + num
    num //= 2
    return  num
print(convert_decimal_to_binaryconvert_decimal_to_binary(number))